import matplotlib.pyplot as plt

# Данные
matrix_sizes = [100, 600, 1100, 1600, 2100]
threads = [1, 2, 4, 8, 16, 32, 64, 128]

# Время выполнения [threads][matrix_size]
execution_times = {
    1:    [0.000687, 1.318571, 10.812575, 50.890545, 132.551105],
    2:    [0.000106, 1.362734, 10.897813, 53.280188, 127.975429],
    4:    [0.000195, 1.412218, 11.664453, 58.515232, 142.712706],
    8:    [0.002967, 1.841917, 16.234494, 80.385389, 190.003424],
    16:   [0.001673, 2.406269, 25.246862, 116.372432, 294.901854],
    32:   [0.003621, 2.422080, 24.386701, 116.193300, 299.413031],
    64:   [0.003829, 2.374002, 25.406129, 113.228728, 294.838874],
    128:  [0.009225, 2.170494, 24.683224, 96.366669, 238.772544],
}

# Построение графика
for thread_count, times in execution_times.items():
    plt.plot(matrix_sizes, times, marker='o', label=f'{thread_count} потоков')

plt.title('Зависимость времени от размера матрицы и количества потоков')
plt.xlabel('Размер матрицы (N x N)')
plt.ylabel('Время выполнения (сек)')
plt.grid(True)
plt.legend(title='Потоки')
plt.tight_layout()
plt.show()
